spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::set_address(uint8_array_t *address){
	DEBUG_TRACE("%s:: ",__func__);
	if(address->size != SMDSAT_CMD_READ_ADDR_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, address->size, SMDSAT_CMD_READ_ADDR_LEN);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_ADDR_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_ADDR_LEN], rx[SMDSAT_CMD_WRITE_ADDR_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_ADDR;
	memcpy(&(tx[1]), &address->p_data, address->size);
	send_command(tx, rx, (uint16_t)SMDSAT_CMD_WRITE_ADDR_LEN);
	
	return;
}

void SmdSat::read_seckey(uint8_array_t *seckey){
	DEBUG_TRACE("%s",__func__);
	if(seckey->size != SMDSAT_CMD_READ_SECKEY_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, seckey->size, SMDSAT_CMD_READ_SECKEY_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_SECKEY);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);

	uint8_t tx[SMDSAT_CMD_READ_SECKEY_LEN] = {0};
	send_command(tx, seckey->p_data, seckey->size);
	// Create a buffer to build the output string.
    char buffer[128];
    int offset = 0;

    // Start the message
    offset += snprintf(buffer + offset, sizeof(buffer) - offset, "SMD SecKey read:");

    // Loop through each of the 16 bytes and append them in hexadecimal format.
    for (size_t i = 0; i < seckey->size; i++) {
        offset += snprintf(buffer + offset, sizeof(buffer) - offset, " 0x%02X", seckey->p_data[i]);
    } 
	DEBUG_INFO("%s", buffer);
	return;
}


void SmdSat::set_seckey(uint8_array_t *seckey){
	DEBUG_TRACE("%s:: ",__func__);
	if(seckey->size != SMDSAT_CMD_WRITE_SECKEY_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, seckey->size, SMDSAT_CMD_WRITE_SECKEY_LEN);
		return;
	}
	send_command(SMDSAT_CMD_WRITE_SECKEY_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_SECKEY_LEN], rx[SMDSAT_CMD_WRITE_SECKEY_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_SECKEY;
	memcpy(&(tx[1]), &seckey->p_data, seckey->size);
	send_command(tx, rx, SMDSAT_CMD_WRITE_SECKEY_LEN);
	
	// Create a buffer to build the output string.
    char buffer[128];
    int offset = 0;

    // Start the message
    offset += snprintf(buffer + offset, sizeof(buffer) - offset, "SMD SecKey write:");

	for (size_t i = 0; i < seckey->size; i++) {
        offset += snprintf(buffer + offset, sizeof(buffer) - offset, " 0x%02X", seckey->p_data[i]);
    } 
	DEBUG_INFO("%s", buffer);
	return;
}
void SmdSat::read_id(uint32_t *id){
	if (id == nullptr) 
	{
		DEBUG_ERROR("%s::id ptr is null",__func__);
		return;
	}
	send_command(SMDSAT_CMD_READ_ID);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	send_command(tx, rx,SMDSAT_CMD_READ_ID_LEN);
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*id |= rx[i] << (8 * i);
	 }
	DEBUG_INFO("%s::SMD ID: 0x%u", __func__, *id);
	return;
}
void SmdSat::set_id(uint32_t id){
	DEBUG_TRACE("%s:: id: %u",__func__, id);
	send_command(SMDSAT_CMD_WRITE_ID_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_ID_LEN], rx[SMDSAT_CMD_WRITE_ID_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_ID;
	memcpy(&(tx[1]), &id, sizeof(id));
	send_command(tx, rx, SMDSAT_CMD_WRITE_ID_LEN);
	return;
}

void SmdSat::read_tcxo_warmup(uint8_t *time_ms){
	if (time_ms == nullptr) 
	{
		DEBUG_ERROR("%s::tcxo ptr is null",__func__);
		return;
	}
	send_command(SMDSAT_CMD_READ_ID);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_READ_ID_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_ID_LEN] = {0};
	send_command(tx, rx,SMDSAT_CMD_READ_ID_LEN);
	for (int i = 0; i < SMDSAT_CMD_READ_ID_LEN; i++) {
		*time_ms |= rx[i] << (8 * i);
	 }
	DEBUG_INFO("%s::SMD TCXO wamrup time: %u", __func__, *time_ms);
	return;
}
void SmdSat::write_tcxo_warmup(uint32_t time_ms){
	DEBUG_TRACE("%s:: tcxo warmup time: %u",__func__, time_ms);
	send_command(SMDSAT_CMD_WRITE_TCXO_REQ);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	uint8_t tx[SMDSAT_CMD_WRITE_TCXO_LEN], rx[SMDSAT_CMD_WRITE_TCXO_LEN] = {0};
	tx[0] = SMDSAT_CMD_WRITE_TCXO;
	memcpy(&(tx[1]), &time_ms, sizeof(time_ms));
	send_command(tx, rx, SMDSAT_CMD_WRITE_ID_LEN);
	
	return;
}
void SmdSat::read_serial(uint8_array_t *serial){
	DEBUG_TRACE("%s",__func__);
	if(serial->size != SMDSAT_CMD_READ_SERIAL_LEN){
		DEBUG_ERROR("%s::Size allocated to store address %u != from %u",
			__func__, serial->size, SMDSAT_CMD_READ_SERIAL_LEN);
		return;
	}
	send_command(SMDSAT_CMD_READ_SN);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	
	uint8_t tx[SMDSAT_CMD_READ_SERIAL_LEN] = {0};
	send_command(tx, serial->p_data, serial->size);
	DEBUG_INFO("SMD SN: %.*s", serial->size, serial->p_data);
	return;
}
void SmdSat::set_tcxo_warmup(uint32_t time_s)
{
    DEBUG_TRACE("SmdSat::set_tcxo_warmup:TODO");
	this->write_tcxo_warmup(time_s*1000);
	return;
}

void SmdSat::set_tcxo_control(bool state) {
    DEBUG_TRACE("SmdSat::set_tcxo_control:Managed by SMD module");
}
void SmdSat::print_firmware_version() {
	send_command(SMDSAT_CMD_READ_FIRMWARE);
	uint8_t tx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
	uint8_t rx[SMDSAT_CMD_READ_FIRMWARE_LEN] = {0};
	send_command(tx, rx, (uint16_t)SMDSAT_CMD_READ_FIRMWARE_LEN);
    DEBUG_TRACE("SmdSat::print_firmware_version: %s", rx);
	return;
}


bool SmdSat::smd_ping()
{
    DEBUG_TRACE("SmdSat::%s",__func__);
	send_command(SMDSAT_CMD_PING);
	uint8_t ping = 0;
	read_byte(&ping);
	if (ping == 1) {
		DEBUG_INFO("SmdSat::Ping ACK from SMD received");
		return true;
	} else {
		DEBUG_INFO("SmdSat::Ping not received : received : %u", ping);
		return false; 
	}
}
bool SmdSat::is_tx_finished() {
    DEBUG_TRACE("SmdSat::is_tx_finished:");
    uint8_t kmac_status = 0;
	get_kmac_status(&kmac_status);
	if(kmac_status == MAC_TX_DONE)
	{
		return true;
	} else {
		return false;
	}	
}
bool SmdSat::is_tx_in_progress() {
    DEBUG_TRACE("SmdSat::is_tx_in_progress:TODO");
	
	return true;
}

bool SmdSat::is_command_accepted() {
    DEBUG_TRACE("SmdSat::is_command_accepted:TODO");
	
	return true;
}

bool SmdSat::is_firmware_ready() {
    DEBUG_TRACE("SmdSat::is_firmware_ready:TODO");
	
