spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
}
void SmdSat::state_transmit_pending_enter() {
/* 	m_state_counter = 100;
	if (m_tx_buffer.size())
		initiate_tx();
	else {
		SMD_STATE_CHANGE(transmit_pending, idle);
	 }*/
	return;
}

void SmdSat::state_transmit_pending_exit() {
	m_next_delay = SMDSAT_DELAY_CMD_TX + (m_tcxo_warmup_time*1000);
	return;
	
}

void SmdSat::state_transmit_pending() {
	if (m_tx_buffer.size()) {
		initiate_tx();
		// Clear the interrupt
        notify(ArticEventTxStarted({}));
        SMD_STATE_CHANGE(transmit_pending, transmitting);
	} else {
		SMD_STATE_CHANGE(transmit_pending, idle);
		// Check retries
		if (--m_state_counter == 0) {
			DEBUG_ERROR("ArticSat::state_machine: failed accept SEND command");
	        SMD_STATE_CHANGE(transmit_pending, error);
		} else
			m_next_delay = SMDSAT_DELAY_CMD_MS;
	}
	return;
}

void SmdSat::state_transmitting_enter() {
	// Timeout calculation must allow for TCXO warm-up time on first TX, otherwise
	// use a nominal timeout since no TCXO warm-up will be used
	// TODO: NO TCXO timeout
	//m_state_counter = m_is_first_tx ? (500 + (m_tcxo_warmup_time * 100)) : 500;
	m_state_counter = 5;
	
	//send_command(ARTIC_CMD_START_TX_1M_SLEEP);
    DEBUG_TRACE("SmdSat::state_transmitting_enter:TODO");
	return;
}

void SmdSat::state_transmitting_exit() {
	//TODO: First tx not used
	m_is_first_tx = false; 
	return;
}

void SmdSat::state_transmitting() {
	if (is_tx_finished()) {
		// Clear the interrupt
		// Check if transmission was aborted by user
        if (m_tx_buffer.size()) {
        	m_tx_buffer.clear();
        	notify(ArticEventTxComplete({}));
        }
        SMD_STATE_CHANGE(transmitting, idle);
	} else {
		if (!m_tx_buffer.size()) {
			// Abort transmission
			SMD_STATE_CHANGE(transmitting, stopped);
		} else if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::state_machine: failed to complete TX");
			SMD_STATE_CHANGE(transmitting, error);
		} else
			m_next_delay = SMDSAT_DELAY_CMD_MS;
	}
	return;
}
void SmdSat::stop_send() {
	DEBUG_TRACE("SmdSat::stop_send: TODO");
	m_ack_buffer.clear();
	m_packet_buffer.clear();
	m_tx_buffer.clear();
	return;
}

void SmdSat::start_receive(const ArgosMode mode) {
	DEBUG_TRACE("SmdState::start_receive: not implemented");
	return;
}
bool SmdSat::stop_receive() {
	DEBUG_TRACE("SmdSat::stop_receive: not implemented");
	return false;
}

void SmdSat::set_frequency(const double freq) {
	DEBUG_TRACE("SmdSat::set_frequency: Configure radiomodule conf");
	m_tx_freq = freq;
	return;
}
void SmdSat::initiate_tx() {
	DEBUG_TRACE("SmdSat::%s:Size : %u",__func__, m_tx_buffer.size());
	//TODO check modulation according correct size.
	//LDA2 used for the moment. 
	send_command(SMDSAT_CMD_WRITE_TX_REQ);

	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	//uint16_t size = m_tx_buffer.size();
	uint16_t size = m_tx_buffer.size();
	uint8_t tx_req[SMDSAT_CMD_WRITETX_LEN] = {0};
	uint8_t rx_req[SMDSAT_CMD_WRITETX_LEN] = {0};
	tx_req[0] = SMDSAT_CMD_WRITE_TX_SIZE;
	tx_req[1] =  (size >>8) & 0xFF;
	tx_req[2] =  (size) & 0xFF;

	send_command(tx_req, rx_req, SMDSAT_CMD_WRITETX_LEN);
	nrf_delay_ms(SMDSAT_DELAY_CMD_MS);
	
	uint8_t *tx_msg = NULL;
    uint8_t *rx_msg = NULL;
    tx_msg = static_cast<uint8_t*>(calloc(size + 1, sizeof(uint8_t)));
    rx_msg = static_cast<uint8_t*>(calloc(size + 1, sizeof(uint8_t)));

    if (tx_msg == NULL || rx_msg == NULL) {
        DEBUG_TRACE("Memory allocation failed for TX/RX buffers");
        free(tx_msg);
        free(rx_msg);
        return;
    }

    tx_msg[0] = SMDSAT_CMD_WRITE_TX;

	
    // Copy the content of m_tx_buffer into tx_msg starting at index 1
    memcpy(tx_msg + 1, m_tx_buffer.data(), size);
    //memcpy(tx_msg + 1, TXpayload_LDA2, size);

    send_command(tx_msg, rx_msg, size + 1);

    // Free allocated memory
    free(tx_msg);
    free(rx_msg);
	return;

}
void SmdSat::send(const ArgosMode mode, const ArticPacket& user_payload, const unsigned int payload_length)
{
	// Log the payload length to be sent
    DEBUG_TRACE("SmdSat::send: length %u", payload_length);

    // Determine the maximum allowed payload size based on the current modulation type
    unsigned int max_payload_size = 0;
    switch(m_modulation) {
        case ARGOS_MOD_LDA2:
            max_payload_size = ARGOS_TX_LDA2_PAYLOAD_BYTE_SIZE;
            break;
        case ARGOS_MOD_LDA2L:
            // If you have a different value for LDA2L, use it here.
            // Otherwise, assuming it is the same as LDA2:
            max_payload_size = ARGOS_TX_LDA2_PAYLOAD_BYTE_SIZE;
            break;
        case ARGOS_MOD_LDK:
            max_payload_size = ARGOS_TX_LDK_PAYLOAD_BYTE_SIZE;
            break;
        case ARGOS_MOD_VLDA4:
            max_payload_size = ARGOS_TX_VLDA4_PAYLOAD_BYTE_SIZE;
            break;
        default:
            DEBUG_TRACE("SmdSat::send: Unknown modulation type %d", m_modulation);
            return;
    }

	// Determine the effective payload length:
    //  - Use the minimum of the provided payload_length and the size of user_payload.
    //  - If that value is greater than max_payload_size, we truncate it.
    unsigned int effective_payload_length = std::min(payload_length,
                                                     static_cast<unsigned int>(user_payload.size()));
    if (effective_payload_length > max_payload_size) {
        DEBUG_TRACE("SmdSat::send: Payload size (%u bytes) exceeds maximum allowed (%u bytes) for modulation %d; truncating",
                    effective_payload_length, max_payload_size, m_modulation);
        effective_payload_length = max_payload_size;
    }


    // Initialize (or reinitialize) m_packet_buffer with the proper payload length.
    // This assigns max_payload_size bytes initialized to zero.
    m_packet_buffer.assign(max_payload_size, 0);

    // Copy the actual user payload into m_packet_buffer.
    // This copies only 'payload_length' bytes.
    std::copy(user_payload.begin(), user_payload.begin() + effective_payload_length, m_packet_buffer.begin());

    // Debug log: print the raw hexified packet buffer.
    DEBUG_TRACE("ArticSat::send_packet: raw data[%u]=%s",
                effective_payload_length,
                Binascii::hexlify(m_packet_buffer).c_str());

    // Set the TX mode
    m_tx_mode = mode;
    DEBUG_TRACE("Packet size %u", static_cast<unsigned int>(m_packet_buffer.size()));

    // Power on if not already running
    power_on();

	return;
}

void SmdSat::send_ack(const ArgosMode mode, const unsigned int a_dcs, const unsigned int dl_msg_id, const unsigned int exec_report)
{
	DEBUG_TRACE("SmdSat::send_ack : Not implemented for the moment");
	return;
}
void SmdSat::set_tcxo_warmup_time(const unsigned int time_s) {
	m_tcxo_warmup_time = time_s;
	return;
}

void SmdSat::set_tx_power(const BaseArgosPower power) {
	m_tx_power = power;
	return;
}